// Задача №7. Напишите программу, которая принимает на вход
//  трёхзначное число и на выходе показывает последнюю цифру этого числа.
// 	456 -> 6
// 	782 -> 2
// 	918 -> 8

int a =1212;

string A = Convert.ToString(a);

int count = A.Length;
System.Console.WriteLine(count);
